Attached Detail Group can't be copied without its Model Group
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotCopyNoAttachedParent { get; }
  Visual Basic
Public Shared ReadOnly Property CannotCopyNoAttachedParent As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotCopyNoAttachedParent {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures CopyPasteFailures Class
  Autodesk.Revit.DB Namespace